;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
(package! academic-phrases :recipe (:host github :repo "nashamri/academic-phrases"))
(package! company-quickhelp :recipe (:host github :repo "expez/company-quickhelp"))
(package! dap-mode :recipe (:host github :repo "emacs-lsp/dap-mode"))
(package! imenu-anywhere)
(package! ivy-avy)
(package! jupyter :recipe (:host github :repo "srnnkls/emacs-jupyter" :branch "develop") :pin "715e1d4")
(package! magit-vcsh :recipe (:host gitlab :repo "stepnem/magit-vcsh-el"))
(package! org-ref :recipe (:host github :repo "jkitchin/org-ref"))
(package! ivy-omni-org :recipe (:host github :repo "akirak/ivy-omni-org"))
(package! counsel-org-clock :recipe (:host github :repo "akirak/counsel-org-clock"))
(package! ox-ipynb :recipe (:host github :repo "srnnkls/ox-ipynb"))
(package! persistent-overlays :recipe (:host github :repo "srnnkls/Emacs-Persistent-Overlays"))
;; (package! poly-markdown :recipe (:host github :repo "polymode/poly-markdown"))
;; (package! poly-org :recipe (:host github :repo "polymode/poly-org"))
;; (package! polymode :recipe (:host github :repo "polymode/polymode"))
(package! powerthesaurus :recipe (:host github :repo "SavchenkoValeriy/emacs-powerthesaurus"))
(package! python-docstring-mode :recipe (:host github :repo "glyph/python-docstring-mode"))
(package! swiper :recipe (:host github :repo "abo-abo/swiper"))
(package! targets :recipe (:host github :repo "noctuid/targets.el"))
(package! tree-sitter)
(package! tree-sitter-langs)
(package! yadm :recipe (:host github :repo "srnnkls/yadm.el"))
(package! code-cells :recipe (:host github :repo "srnnkls/code-cells.el"))
(package! zmq)
(unpin! evil-multiedit)
(unpin! iedit)
(unpin! lsp-mode)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
;; (package! org :recipe (:commit "1b3cc4e4631a07c41632040439b73c1938714308"))
;; (package! pdf-tools)
;; (package! some-package)
